Обработки/Reports/_КоличествоИСтоимостьСобственныхПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КоличествоИСтоимостьСобственныхПаев</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводимыеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрКлиентов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчетаСреднейСЧА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КоличествоИСтоимостьСобственныхПаев/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Количество и стоимость собственных паев, СЧА",
		"1.10",
		"Выводит количество и стоимость паев ПИФ, а также СЧА по виду договора/клиенту за период",
		Истина
	);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ВариантРасчетаСреднейСЧА = 1 И НачалоГода(ЭтотОбъект.Период.ДатаНачала) <> НачалоГода(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для варианта расчета средней СЧА 'Среднее от количества рабочих дней в году' период отчета должен быть в одном календарном году");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Вариант = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	
	// Вариант календаря для ЗПИФ должен быть только у ПИФов
	Если ЭтотОбъект.ВыводимыеДни = 4 И Вариант = "СЧА" Тогда
		
		ВерныйОтбор = Истина;
		Если ЭтотОбъект.ФильтрКлиентов = "" И ЗначениеЗаполнено(ЭтотОбъект.Клиент) Тогда			
			ВерныйОтбор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Клиент, "ВидДоговораДоверительногоУправления") = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
		ИначеЕсли ЭтотОбъект.ФильтрКлиентов = "ПоВидуДоговораДУ" Тогда
			ВерныйОтбор = ЭтотОбъект.ВидДоговораДУ = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
		КонецЕсли;
			
		Если Не ВерныйОтбор Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Вариант дней 'Даты СЧА для ЗПИФ' возможен для только для ПИФ или вида договора 'Упраление активами паевого инвестиционного фонда'");
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Ложь);	
		
	ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 				ЭтотОбъект.Организация);
	ПараметрыДанных.УстановитьЗначениеПараметра("ПериодДляЗаголовка", 		ЭтотОбъект.Период);
	ПараметрыДанных.УстановитьЗначениеПараметра("ВариантРасчетаСреднейСЧА", ЭтотОбъект.ВариантРасчетаСреднейСЧА);
	РабочихДнейВГоду = Справочники.Календари.КоличествоРабочихДней(Справочники.Календари.Общероссийский, НачалоГода(ЭтотОбъект.Период.ДатаНачала), КонецГода(ЭтотОбъект.Период.ДатаОкончания));
	ПараметрыДанных.УстановитьЗначениеПараметра("РабочихДнейВГоду", 		РабочихДнейВГоду);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ПИФ) И Вариант <> "СЧА" Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра("ПИФ", ЭтотОбъект.ПИФ);
	Иначе
		ПараметрыДанных.Элементы.Найти("ПИФ").Использование = Ложь;		
	КонецЕсли;
	
	Если Вариант = "СЧА" И ЭтотОбъект.ФильтрКлиентов = "" Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра("Клиент", ЭтотОбъект.Клиент);
	Иначе
		ПараметрыДанных.Элементы.Найти("Клиент").Использование = Ложь;		
	КонецЕсли;	
	
	Если Вариант = "СЧА" И ЭтотОбъект.ФильтрКлиентов = "ПоВидуДоговораДУ" Тогда
		ПараметрыДанных.УстановитьЗначениеПараметра("ВидДоговораДУ", ЭтотОбъект.ВидДоговораДУ);
	Иначе
		ПараметрыДанных.Элементы.Найти("ВидДоговораДУ").Использование = Ложь;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	                          	
	Запрос.УстановитьПараметр("Организация", 		ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоДня(ЭтотОбъект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода", 		НачалоДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВыводимыеДни", 		ЭтотОбъект.ВыводимыеДни);	
	Запрос.УстановитьПараметр("КалендарьКотировок", Константы.ОсновнойКалендарьКотировок.Получить());
		
	Если ЗначениеЗаполнено(ЭтотОбъект.ПИФ) И Вариант <> "СЧА" Тогда
		Запрос.УстановитьПараметр("ПИФ", ЭтотОбъект.ПИФ);
	КонецЕсли;
	
	Если Вариант = "СЧА" И ЭтотОбъект.ФильтрКлиентов = "" Тогда
		Запрос.УстановитьПараметр("Клиент", ЭтотОбъект.Клиент);
	КонецЕсли;	
	
	Если Вариант = "СЧА" И ЭтотОбъект.ФильтрКлиентов = "ПоВидуДоговораДУ" Тогда
		Запрос.УстановитьПараметр("ВидДоговораДУ", ЭтотОбъект.ВидДоговораДУ);
	КонецЕсли;	
	
	ПоместитьДниКалендаряИСЧАВМенеджерВременныхТаблиц(Запрос, Вариант, ПараметрыДанных);
	
	#Область Тест_Запроса
	
	Если Вариант = "СЧА" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
			|	_Дни.Дата КАК Дата,
			|	_СЧА.СЧА КАК СЧА
			|ИЗ
			|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
			|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
			|		ПО (_СЧА.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления)
			|			И (_СЧА.Дата = _Дни.Дата)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ВыводимыеДни = 3
			|				ТОГДА _СЧА.СЧА ЕСТЬ НЕ NULL 
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ"
		
	Иначе	
		
	    Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КоличествоПаев.ПаевойИнвестиционныйФонд КАК ПИФ,
			|	КоличествоПаев.Период КАК Дата,
			|	КоличествоПаев.КоличествоКонечныйОстаток КАК Количество
			|ПОМЕСТИТЬ _КоличествоПаев
			|ИЗ
			|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.ОстаткиИОбороты(
			|			&НачалоПериода,
			|			&КонецПериода,
			|			День,
			|			ДвиженияИГраницыПериода,
			|			Организация = &Организация
			|				И ПаевойИнвестиционныйФонд В
			|					(ВЫБРАТЬ
			|						_СчетаДоверительногоУправления.Клиент
			|					ИЗ
			|						_СчетаДоверительногоУправления)) КАК КоличествоПаев
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СобственныеПИФы.ПИФ КАК ПИФ,
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _СобственныеПИФы
			|ИЗ
			|	_КоличествоПаев КАК СобственныеПИФы
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
			|		ПО СобственныеПИФы.ПИФ = _СчетаДоверительногоУправления.Клиент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.Клиент КАК ПИФ,
			|	СтоимостьПая.Период КАК Дата,
			|	СтоимостьПая.Значение КАК Стоимость
			|ПОМЕСТИТЬ _СтоимостьПаев
			|ИЗ
			|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СтоимостьПая
			|		ПО (СтоимостьПая.Организация = &Организация)
			|			И (СтоимостьПая.СубъектАналитики = _СчетаДоверительногоУправления.СчетДоверительногоУправления)
			|			И (СтоимостьПая.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьПая))
			|			И (СтоимостьПая.Период МЕЖДУ &НачалоПериода И &КонецПериода)
			|;
			|			
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СобственныеПИФы.ПИФ КАК ПИФ,
			|	_Дни.Дата КАК Дата,
			|	МАКСИМУМ(_КоличествоПаев.Дата) КАК ДатаИзменения
			|ПОМЕСТИТЬ _ДатыИзмененияКоличестваПаев
			|ИЗ
			|	_СобственныеПИФы КАК _СобственныеПИФы
			|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _КоличествоПаев КАК _КоличествоПаев
			|		ПО (_КоличествоПаев.ПИФ = _СобственныеПИФы.ПИФ)
			|			И (_КоличествоПаев.Дата <= _Дни.Дата)
			|
			|СГРУППИРОВАТЬ ПО
			|	_СобственныеПИФы.ПИФ,
			|	_Дни.Дата
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СобственныеПИФы.ПИФ КАК Клиент,
			|	_СобственныеПИФы.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_Дни.Дата КАК Дата,
			|	_КоличествоПаев.Количество КАК Количество,
			|	_СтоимостьПаев.Стоимость КАК Стоимость,
			|	_СЧА.СЧА КАК СЧА
			|ИЗ
			|	_СобственныеПИФы КАК _СобственныеПИФы
			|		ПОЛНОЕ СОЕДИНЕНИЕ _Дни КАК _Дни
			|		ПО (ИСТИНА)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыИзмененияКоличестваПаев КАК _ДатыИзмененияКоличестваПаев
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КоличествоПаев КАК _КоличествоПаев
			|			ПО (_КоличествоПаев.ПИФ = _ДатыИзмененияКоличестваПаев.ПИФ)
			|				И (_КоличествоПаев.Дата = _ДатыИзмененияКоличестваПаев.ДатаИзменения)
			|		ПО (_ДатыИзмененияКоличестваПаев.ПИФ = _СобственныеПИФы.ПИФ)
			|			И (_ДатыИзмененияКоличестваПаев.Дата = _Дни.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СтоимостьПаев КАК _СтоимостьПаев
			|		ПО (_СтоимостьПаев.ПИФ = _СобственныеПИФы.ПИФ)
			|			И (_СтоимостьПаев.Дата = _Дни.Дата)
			|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
			|		ПО (_СЧА.ПИФ = _СобственныеПИФы.ПИФ)
			|			И (_СЧА.Дата = _Дни.Дата)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ВыводимыеДни = 3
			|				ТОГДА _СтоимостьПаев.Стоимость ЕСТЬ НЕ NULL 
			|						ИЛИ _СЧА.СЧА ЕСТЬ НЕ NULL 
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ";
		
	КонецЕсли;	
	
	#КонецОбласти
	
	ВнешниеНаборыДанных = Новый Структура("ТаблицаРезультата", Запрос.Выполнить().Выгрузить()); 
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,,, ВнешниеНаборыДанных)
	    	
КонецПроцедуры

Функция ПоместитьДниКалендаряИСЧАВМенеджерВременныхТаблиц(Запрос, Вариант, ПараметрыДанных)
	
	// Получим список счетов ДУ 
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И НАЧАЛОПЕРИОДА(СчетДоверительногоУправления.ДатаЗаключения, ГОД) <= НАЧАЛОПЕРИОДА(&Период, ГОД)
		|				И (СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ КОНЕЦПЕРИОДА(СчетДоверительногоУправления.ДатаРасторжения, ГОД) >= &Период)
		|				И СчетДоверительногоУправления = &Отбор) КАК КлиентыДоверительногоУправленияСрезПоследних";
	
	Если Вариант <> "СЧА" И ПараметрыДанных.Элементы.Найти("ПИФ").Использование Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ КлиентыДоверительногоУправленияСрезПоследних.Клиент = &ПИФ";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &Отбор", "СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)"); 
	ИначеЕсли Вариант <> "СЧА" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &Отбор", "СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)"); 	
	ИначеЕсли ПараметрыДанных.Элементы.Найти("Клиент").Использование Тогда                  		
		Запрос.УстановитьПараметр("Отбор", ЭтотОбъект.Клиент);
	ИначеЕсли ПараметрыДанных.Элементы.Найти("ВидДоговораДУ").Использование Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &Отбор", "СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = &Отбор"); 
		Запрос.УстановитьПараметр("Отбор", ЭтотОбъект.ВидДоговораДУ);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетДоверительногоУправления = &Отбор", "ИСТИНА"); 
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Период",			ЭтотОбъект.Период.ДатаОкончания);
	
	Запрос.Выполнить();
	
	// Помещаем календарь СЧА
	Если ВыводимыеДни = 4 Тогда
		
		// Есть готовый механизм
		// Для ЗПИФ нужно также получить дату последней СЧА на начало периода отчета
		ДатаНачала = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаНачала, -2);
		Справочники.НастройкиРегламентныхДействий.ПоместитьДатыДействияЗаПериодВоВременнуюТаблицу(Запрос, Новый Структура("ВидДействия, ДатаС, ДатаПо, ДополнитьРабочимиДнями", "СЧА", ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, Ложь)); 
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДатыДействияЗаПериод.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
			|	_ДатыДействияЗаПериод.Дата КАК Дата
			|ПОМЕСТИТЬ _ДниКалендаряСЧА
			|ИЗ
			|	_ДатыДействияЗаПериод КАК _ДатыДействияЗаПериод
			|	ЛЕВОЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления
		    |	ПО _ДатыДействияЗаПериод.СчетДоверительногоУправления = _СчетаДоверительногоУправления.СчетДоверительногоУправления";
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_СчетаДоверительногоУправления.Клиент КАК Клиент,
			|	ДанныеКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _ДниКалендаряСЧА
			|ИЗ
			|	_СчетаДоверительногоУправления КАК _СчетаДоверительногоУправления
			|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
			|		ПО (ИСТИНА)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ВыводимыеДни = 1
			|				ТОГДА ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|						И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|			КОГДА &ВыводимыеДни = 2
			|				ТОГДА ДанныеКалендаря.Календарь = &КалендарьКотировок
			|						И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|			ИНАЧЕ ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|		КОНЕЦ
			|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
				
	КонецЕсли;
			
	Запрос.Выполнить();
	
	// Помещаем общий календарь 
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Дни
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВыводимыеДни = 1
		|					ИЛИ &ВыводимыеДни = 4
		|				ТОГДА ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|						И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|			КОГДА &ВыводимыеДни = 2
		|				ТОГДА ДанныеКалендаря.Календарь = &КалендарьКотировок
		|						И ДанныеКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
		|			ИНАЧЕ ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|		КОНЕЦ
		|	И ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниКалендаряСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Дни.Дата КАК Дата,
		|	МАКСИМУМ(_ДниКалендаряСЧА.Дата) КАК ДатаСЧА
		|ПОМЕСТИТЬ _ДатыСЧА
		|ИЗ
		|	_Дни КАК _Дни
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДниКалендаряСЧА КАК _ДниКалендаряСЧА
		|		ПО _Дни.Дата >= _ДниКалендаряСЧА.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДниКалендаряСЧА.СчетДоверительногоУправления,
		|	_Дни.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДниКалендаряСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДниКалендаряСЧА.Клиент КАК ПИФ,
		|	СЧА.Период КАК Дата,
		|	СЧА.Значение КАК СЧА
		|ПОМЕСТИТЬ _ЗарегистрированныеСЧА
		|ИЗ
		|	_ДниКалендаряСЧА КАК _ДниКалендаряСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК СЧА
		|		ПО (СЧА.Период = _ДниКалендаряСЧА.Дата)
		|			И (СЧА.СубъектАналитики = _ДниКалендаряСЧА.СчетДоверительногоУправления)
		|			И (СЧА.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (СЧА.Организация = &Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ЗарегистрированныеСЧА.ПИФ КАК ПИФ,
		|	_ЗарегистрированныеСЧА.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_ДатыСЧА.Дата КАК Дата,
		|	_ЗарегистрированныеСЧА.СЧА КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	_ДатыСЧА КАК _ДатыСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ЗарегистрированныеСЧА КАК _ЗарегистрированныеСЧА
		|		ПО _ДатыСЧА.СчетДоверительногоУправления = _ЗарегистрированныеСЧА.СчетДоверительногоУправления
		|			И _ДатыСЧА.ДатаСЧА = _ЗарегистрированныеСЧА.Дата";
	
	Запрос.Выполнить();
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Вариант = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	
	Если Вариант = "СЧА" Тогда
		Если ЭтотОбъект.ФильтрКлиентов = "ПоВидуДоговораДУ" Тогда
			ПроверяемыеРеквизиты.Добавить("ВидДоговораДУ");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Клиент");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
